{
    "author": "Aphinya Dechalert",
    "comments": [{
        "comment": "Coding without a plan is cause of pyramid; can be remedied by pseudo coding out your plan before developer begins typing (something junior developers should be encouraged to do by leads).",
        "createdDate": "2019-08-16"
    }, {
        "comment": "Developing in a language with only basic syntactical knowledge, rather than using; OOP, inheritance, and promises.",
        "createdDate": "2019-08-16"
    }, {
        "comment": "Global variables do not scale well, localized variables make for smaller methods which will help defend against the pyramid.",
        "createdDate": "2019-08-16"
    }],
    "description": "Causes and cures to code is indented too many levels to comprehend easily.",
    "publishDate": "2019-03-22",
    "publisher": "IT Next",
    "quotes": [{
        "quote": "A pyramid of doom is a block of code that is so nested that you give up trying to mentally digest it.",
        "createdDate": "2019-08-16"
    }, {
        "quote": "We end up with a pyramid of doom because we don’t know how else to solve the problem.",
        "createdDate": "2019-08-16"
    }, {
        "quote": "Flatten your code and learn to use callback methods instead of nesting functions.",
        "createdDate": "2019-08-16"
    }, {
        "quote": "Every time you refactor your own code as you’re working on it, the better you become at detecting smelly code and anti-patterns as you write them.",
        "createdDate": "2019-08-16"
    }, {
        "quote": "If you find yourself working with a function that feels overly complicated, chances are, it is complicated.",
        "createdDate": "2019-08-16"
    }, {
        "quote": "Beautiful code is complexity simplified.",
        "createdDate": "2019-08-16"
    }],
    "tags": ["best-practice", "programming", "anti-pattern", "javascript"],
    "title": "Pyramid of Doom — the Signs and Symptoms of a common anti-pattern",
    "url": "https://itnext.io/pyramid-of-doom-the-signs-and-symptoms-of-a-common-anti-pattern-c716838e1819",
    "createdDate": "2019-08-16"
}