{
    "author": "Matt Klein",
    "comments": [{
        "comment": "First argument against monorepos; they will scale to be too big for a single developers machine..",
        "createdDate": "2019-08-14"
    }, {
        "comment": "A counter argument against monorepos helping with dependency management is that they don't.. tracking versions is hard and monorepos have CI pipelines to help with tracking. Another weak point.",
        "createdDate": "2019-08-14"
    }, {
        "comment": "Decent downside point is it may make developers more at ease at making mistakes.",
        "createdDate": "2019-08-14"
    }, {
        "comment": "Scaling a monorepo can negatively affect git's performance, even for git status commands.",
        "createdDate": "2019-08-14"
    }],
    "description": "An argument against monorepo projects.",
    "publishDate": "2019-01-02",
    "publisher": "Medium",
    "quotes": [{
        "quote": " It gives developers the feeling they can easily fix abstraction mistakes, when they actually cannot in the real world due to the realities of staggered build/deploy and the human/organizational/cultural factors inherent in asking developers to make changes across the entire codebase.",
        "createdDate": "2019-08-14"
    }, {
        "quote": "Polyrepo code layout offers clear team/project/abstraction/ownership boundaries and encourages developers to think carefully about contracts. ",
        "createdDate": "2019-08-14"
    }, {
        "quote": "The frank reality is that, at scale, how well an organization does with code sharing, collaboration, tight coupling, etc. is a direct result of engineering culture and leadership, and has nothing to do with whether a monorepo or a polyrepo is used.",
        "createdDate": "2019-08-14"
    }],
    "tags": ["monorepo", "git", "version-control", "software"],
    "title": "Monorepos: Please don’t!",
    "url": "https://medium.com/@mattklein123/monorepos-please-dont-e9a279be011b",
    "createdDate": "2019-08-14"
}